app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.order(starts_at: :asc)
                               .paginate(page: params[:page], per_page: 5)
---
SELECT  "appointments".* FROM "appointments"  ORDER BY "appointments"."starts_at" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "appointments"

  def update
    doctor_and_patients
    if @appointment.update appointment_params
---
UPDATE "appointments" SET "ends_at" = ?, "patient_id" = ?, "doctor_id" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["ends_at", "2000-01-01 17:30:00.000000"], ["patient_id", 2], ["doctor_id", 5], ["updated_at", "2021-07-04 03:33:11.300119"], ["id", 4]]

  def create
    doctor_and_patients
    @appointment = Appointment.new appointment_params
    if @appointment.save
---
INSERT INTO "appointments" ("appointment_date", "starts_at", "ends_at", "patient_id", "doctor_id", "appointment_description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 2]]