app/controllers/dashboards_controller.rb

  def index
    @doctors = Doctor.all
    @dashboards = Appointment.all
                             .paginate(page: params[:page], per_page: 10)
---
SELECT "doctors".* FROM "doctors"
SELECT  "appointments".* FROM "appointments" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "appointments"

  def search
    doctor_id = params[:doctor][:id]
    @doctor = Doctor.find(doctor_id)
    @doctors = Doctor.all
    @dashboards = Appointment.where('doctor_id = ?', doctor_id)
    @appointments_by_doctor = Appointment.where('doctor_id = ?', doctor_id)
                                         .count
    @patients_by_doctor = Appointment.where('doctor_id = ?', doctor_id)
                                     .distinct
                                     .count(:patient_id)
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 5]]
SELECT "doctors".* FROM "doctors"
SELECT "appointments".* FROM "appointments" WHERE (doctor_id = NULL)
SELECT COUNT(*) FROM "appointments" WHERE (doctor_id = '8')
SELECT COUNT(*) AS count_all, "appointments"."patient_id" AS appointments_patient_id FROM "appointments" WHERE (doctor_id = '6') GROUP BY "appointments"."patient_id"