app/controllers/doctors_controller.rb

SELECT  "doctors".* FROM "doctors" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "doctors"
---
  def index
    @doctors = Doctor.all
                     .paginate(page: params[:page], per_page: 5)

INSERT INTO "doctors" ("name", "crm", "crm_uf", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "adilson"], ["crm", 109210], ["crm_uf", 0], ["created_at", "2021-06-30 23:33:07.596746"], ["updated_at", "2021-06-30 23:33:07.596746"]]
---
  def create
    pick_ufs
    @doctor = Doctor.new(doctor_params)
    if @doctor.save

UPDATE "doctors" SET "name" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["name", "adilson viado"], ["updated_at", "2021-07-03 18:21:02.565115"], ["id", 1]]
---
  def update
    pick_ufs
    if @doctor.update(doctor_params)

DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 1]]
---
  def destroy
    if @doctor.destroy

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 4]]
---
  def set_doctor
    @doctor = Doctor.find(params[:id])