app/controllers/patients_controller.rb

  def index
    @patients = Patient.all.paginate(page: params[:page], per_page: 5)
---
SELECT  "patients".* FROM "patients" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "patients"

  def create
    @patient = Patient.new(patient_params)

    if @patient.save
---
INSERT INTO "patients" ("name", "birth_date", "cpf", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "willian"], ["birth_date", "2010-02-22 00:00:00.000000"], ["cpf", "11675909011"], ["created_at", "2021-06-30 22:50:43.195858"], ["updated_at", "2021-06-30 22:50:43.195858"]]

  def update
    if @patient.update(patient_params)
---
UPDATE "patients" SET "name" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["name", "bruno castro silva"], ["updated_at", "2021-07-03 18:14:42.626803"], ["id", 2]]

  def destroy
    if @patient.destroy
---
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 3]]

  def set_patient
    @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 3]]